# coding=utf8
# Домашнее задание к первому уроку

# Задача - 1
# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран.

int_var = 132
float_var = 3.14
boolean_var = True

print(f'Капитан очевидность: Значения переменных инициализированных при старте программы'
      f' int_var = {int_var} boolean_var = {float_var} boolean_var = {boolean_var}')

name = input('Ваше имя: ')
surname = input('Ваша фамилия: ')
age = int(input('Ваш возраст: '))
favorite_number = int(input('Любимое число: '))
print(f'Капитан очевидность: Привет, {name} {surname}, тебе {age} год/года/лет. Твое любимое число {favorite_number}')

# Задача - 2
# Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

ss= int(input('Введие количество секунд: '))
s = ss % 60
m = ss // 60 % 60
h = ss // 60 // 60
print(f'hh:mm:ss - {h:02}:{m:02}:{s:02}')

# Задача - 3
# Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.

#В задании предлагается узнать у пользовавтеля число, а не цифру, хотя, наверное, 0 < n < 10
# n + nn + nnn = n * 1 + n * 11 + n * 111 = n(1 + 11 + 111) = 123n

n = int(input('Введите число n от 1 до 9: '))
if 0 < n < 10:
    print(f'n + nn + nnn = {n*123}')
else:
    print('Введено неверное число.')


# Задача - 4
# Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

num = int(input('Введите число: '))
max = num % 10
tmp = num // 10
while max < 9 and tmp >0:
    if tmp % 10 > max:
        max = tmp % 10
    tmp = tmp // 10
print(f'Самая большая цифра числа {num} - {max}')



# Задача - 5
# Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом
# работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность
# выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

revenue  = float(input('Выручка фирмы: '))
costs = float(input('Издержки фирмы: '))
profit = revenue - costs

if profit == 0:
    print('Фирма работает в 0.')
elif profit < 0:
    print('Фирма работает в убыток.')
else:
    print(f'Фирма работает с прибылью. Рентабельность - {profit/revenue*100:.2f}%.')
    num_of_employees = int(input('Численность сотрудников: '))
    print(f'Прибыль на одного сотрудника - {profit / num_of_employees:.2f}.')

# Задача - 6
# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

a = float(input('Пробежал в 1 день: '))
b = float(input('Необходимо пробежать: '))
day = 1
while a<b:
    day = day + 1
    a = a * 1.1
    print(f'{day}-й день: {a:.2f}')
print(f'на {day}-й день спортсмен достиг результата — не менее {b} км.')

#