# coding=utf8

# 6. реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. например, print(int_func(‘text’)) -> text.
# продолжить работу над заданием. в программу должна попадать строка из слов, разделенных пробелом.
# каждое слово состоит из латинских букв в нижнем регистре. сделать вывод исходной строки,
# но каждое слово должно начинаться с заглавной буквы. необходимо использовать написанную ранее функцию int_func().

def int_func(s):
    """
    :param s: строка из ластинских маленьких букв
    :return:  Та же строка но с большой буквы
    """
    if not (set(s) < set('abcdefghijklmnopqrstuvwxyz') and s != ''):
        raise ValueError(f'параметр "{s}" не соответствует ограничению - строка из мальньких латинских букв')
    else:
        return s[0].upper()+s[1:]


ss = input('Введите строку из слов сотоящих из маленьких латинских букв разделеных пробелами :')
try:
    res = ' '.join([int_func(s) for s in ss.split(' ')])
except ValueError:
    print('Неверные входные данные')
else:
    print(res)
