# coding=utf8

# 6. реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. например, print(int_func(‘text’)) -> text.
# продолжить работу над заданием. в программу должна попадать строка из слов, разделенных пробелом.
# каждое слово состоит из латинских букв в нижнем регистре. сделать вывод исходной строки,
# но каждое слово должно начинаться с заглавной буквы. необходимо использовать написанную ранее функцию int_func().

