# coding=utf8

# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки нужно пронумеровать.
# Если слово длинное, выводить только первые 10 букв в слове.

user_str = input('Строка: ')
str_list = user_str.split()
num = 0
for s_str in str_list:
    num += 1
    print(f'{num} : {s_str[0:10]}')