# coding=utf8

# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки нужно пронумеровать.
# Если слово длинное, выводить только первые 10 букв в слове.

user_str = input('Строка: ')
str_list = user_str.split()

for ind, el in enumerate(str_list):
    print(ind, el[0:10])