# coding=utf8

"""
2. Для списка реализовать обмен значений соседних элементов.
Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т. д.
При нечётном количестве элементов последний сохранить на своём месте.
Для заполнения списка элементов нужно использовать функцию input().

Решение:
Т.к. условие задачи не предполагает работу со значениями списка - пусть все значения будут строками. Будем запрашивать
у пользователя данные в цикле пока он не оставит строку пустой (можно оставить пользователю возможность ввода пустой
строки, но т.к. на смысл задачи это не влияет будет считать что пустая стрка - это завершение ввода списка)

"""
user_list = []
item = ' '
while item != '':
    item = input('Введите элемент списка, для завершения ввода оставьте строку пустой:')
    if item != '':
        user_list.append(item)
print(f'Результат ввода: {user_list}')

for i in range(1,len(user_list),2):
    user_list[i-1], user_list[i] = user_list[i], user_list[i-1]
print(f'Результат: {user_list}')