# coding=utf8

# 6.*Реализовать структуру данных «Товары».
# Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.

# В кортеже должно быть два элемента — номер товара и словарь с параметрами,
# то есть характеристиками товара: название, цена, количество, единица измерения.
# Структуру нужно сформировать программно, запросив все данные у пользователя.
# Пример готовой структуры:
# [
#     (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#     (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#     (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Нужно собрать аналитику о товарах.
# Реализовать словарь, в котором каждый ключ — характеристика товара, например, название.
# Тогда значение — список значений-характеристик, например, список названий товаров.
goods = []
units = {1:'шт.',2:'упак.',3:'бут.',4:'короб.'}
answer = ''
while answer != '4':
    print('1. Добавть товар.')
    print('2. Вывести товары.')
    print('3. Аналитика по товарам.')
    print('4. Завершить работу.')
    answer = input('Выберите вариант: ')
    if answer == '1':
        try:
            name = input('Введите наименование товара: ')
            price = float(input('Введите цену товара: '))
            quantity = int(input('Введите количество товара: '))
            unit = units[int(input(f'Выберите единицу измерения товара {units}: '))]
        except Exception:
            print('Введены неверные данные. попробуйте еще раз')
        else:
            goods.append((len(goods)+1,{'название': name, 'цена': price, 'количество': quantity, 'eд': unit}))
    elif answer == '2':
        if len(goods) == 0:
            print('Пусто')
        else:
            print('Товары:')
            for i in goods:
                print(i)
    elif answer == '3':
        print('Аналитика по товарам:')
        analytics = {'название': [], 'цена': [], 'количество': [], 'eд': []}
        for i in goods:
            for key, value in i[1].items():
                analytics[key].append(value)
        for key, value in analytics.items():
            analytics[key] = list(set(value))
        print(analytics)
    elif answer == '4':
        print('Завершение')
    else:
        print('Нет такой опции. Попробуйте ещё раз.')


