# 2. Реализовать класс Road (дорога).
#
# определить атрибуты: length (длина), width (ширина);
# значения атрибутов должны передаваться при создании экземпляра класса;
# атрибуты сделать защищёнными;
# определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
# использовать формулу: длина*ширина*масса асфальта для покрытия одного кв. метра дороги асфальтом,
# толщиной в 1 см*число см толщины полотна;
# проверить работу метода.
#
# Например: 20 м*5000 м*25 кг*5 см = 12500 т.

class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width

    def print_asphalt_mass(self, consumption, depth):
        requirement = self._width * self._length * depth * consumption
        print(f'Для асфальтирования дороги понадобится {requirement/1000:.2f} т. асфальта')


if __name__ == '__main__':
    road_1 = Road(5000, 20)
    road_1.print_asphalt_mass(25, 5)
