# coding=utf8
# представлен список чисел. необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# подсказка: элементы, удовлетворяющие условию, оформить в виде списка. для формирования списка использовать генератор.
# пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# результат: [12, 44, 4, 10, 78, 123].


x = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
y = [x[z] for z in range(1,len(x)) if x[z]>x[z-1]]
print(f'исходный список {x}')
print(f'результирующий список {y}')
